{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "I1",
    "1": "I2",
    "2": "I3",
    "3": "I4",
    "4": "U1",
    "5": "U2",
    "6": "U3",
    "7": "U4",
    "8": "T1",
    "9": "T2",
    "10": "T3",
    "11": "T4",
    "12": "T5"
  },
  "initializer_range": 0.02,
  "label2id": {
    "I1": 0,
    "I2": 1,
    "I3": 2,
    "I4": 3,
    "T1": 8,
    "T2": 9,
    "T3": 10,
    "T4": 11,
    "T5": 12,
    "U1": 4,
    "U2": 5,
    "U3": 6,
    "U4": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "vocab_size": 30522,
  
    "LABEL_DICTIONARY": {
      "I1": "Low Impact",
      "I2": "Medium Impact",
      "I3": "High Impact",
      "I4": "Critical Impact",
      "U1": "Low Urgency",
      "U2": "Medium Urgency",
      "U3": "High Urgency",
      "U4": "Critical Urgency",
      "T1": "Information",
      "T2": "Incident",
      "T3": "Problem",
      "T4": "Request",
      "T5": "Question"
    }
  
}
